### ACQUIRE:
- Goal: leave this section with a dataframe ready to prepare.

- The ad hoc part includes **summarizing your data** as you read it in and begin to explore, look at the **first few rows, data types, summary stats, column names, shape of the data frame, etc**.

- `acquire.py`: The reproducible part is the gathering data from SQL.

In [3]:
import pandas as pd
from env import url

In [ ]:
#Read from Zillow database and write df to a csv
query = '''
    SELECT calculatedfinishedsquarefeet as home_size, 
    bedroomcnt, bathroomcnt, taxvaluedollarcnt as home_value
    FROM properties_2017 
    JOIN predictions_2017 USING(id)
    WHERE transactiondate >= '2017-05-01' AND transactiondate <= '2017-06-30'
'''
df = pd.read_sql_query(query, url("zillow"))
df.head()

In [6]:
# export a csv file
#df.to_csv('zillow.csv')

**Reading data from csv**

In [8]:
df = pd.read_csv('zillow.csv',  index_col=0)
df.head()

   home_size  bedroomcnt  bathroomcnt  home_value
0     2082.0         0.0          0.0    527930.0
1     1000.0         0.0          0.0     27400.0
2     1604.0         4.0          2.0    498347.0
3     2384.0         3.0          3.0    549917.0
4     1574.0         3.0          2.0    235272.0

In [13]:
df.shape

(21943, 4)

In [10]:
df.dtypes

home_size      float64
bedroomcnt     float64
bathroomcnt    float64
home_value     float64
dtype: object

In [11]:
df.describe()

           home_size    bedroomcnt   bathroomcnt    home_value
count   21748.000000  21943.000000  21943.000000  2.179200e+04
mean     1824.627460      3.119902      2.236886  4.449060e+05
std      1897.408302      1.267688      1.096230  6.215639e+05
min        60.000000      0.000000      0.000000  8.000000e+00
25%      1205.000000      2.000000      2.000000  1.838070e+05
50%      1567.000000      3.000000      2.000000  3.151755e+05
75%      2120.000000      4.000000      3.000000  5.097058e+05
max    161232.000000     25.000000     20.000000  1.912982e+07

In [19]:
df.isnull().sum()

home_size      195
bedroomcnt       0
bathroomcnt      0
home_value     151
dtype: int64

In [20]:
df[df.home_size.isnull()]

       home_size  bedroomcnt  bathroomcnt  home_value
8            NaN         0.0          0.0   5240710.0
1616         NaN         0.0          0.0        19.0
2781         NaN         0.0          0.0   9710604.0
2849         NaN         0.0          0.0   5356597.0
2881         NaN         0.0          0.0   2274642.0
...          ...         ...          ...         ...
18163        NaN         0.0          0.0      9984.0
18783        NaN         0.0          0.0    141411.0
18886        NaN         0.0          0.0     56302.0
19855        NaN         0.0          0.0    204801.0
21520        NaN         0.0          0.0   1257330.0

[195 rows x 4 columns]

In [21]:
df[df.home_value.isnull()]

       home_size  bedroomcnt  bathroomcnt  home_value
5375       807.0         3.0          1.0         NaN
5380      1920.0         5.0          2.0         NaN
11800     1197.0         3.0          3.0         NaN
13073        NaN         0.0          0.0         NaN
13108     1344.0         0.0          0.0         NaN
...          ...         ...          ...         ...
14275     1248.0         0.0          0.0         NaN
14276      500.0         0.0          0.0         NaN
14277     1152.0         0.0          0.0         NaN
14278     1140.0         0.0          0.0         NaN
14279      720.0         0.0          0.0         NaN

[151 rows x 4 columns]